# Changes in Net Worth

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

From the following table of transactions between two users, write a query to return the change in net worth for each user, ordered by decreasing net change.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `transactions` table

In [3]:
%%sql

DROP TABLE IF EXISTS transactions;
CREATE TABLE transactions (
  sender INT,
  receiver INT,
  amount MONEY,
  transaction_date DATE
);

INSERT INTO transactions
VALUES
    (5, 2, 10, '2-12-20'),
    (1, 3, 15, '2-13-20'), 
    (2, 1, 20, '2-13-20'), 
    (2, 3, 25, '2-14-20'), 
    (3, 1, 20, '2-15-20'), 
    (3, 2, 15, '2-15-20'), 
    (1, 4, 5,  '2-16-20');

SELECT * FROM transactions;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
7 rows affected.
7 rows affected.

[(5, 2, '$10.00', datetime.date(2020, 2, 12)),
 (1, 3, '$15.00', datetime.date(2020, 2, 13)),
 (2, 1, '$20.00', datetime.date(2020, 2, 13)),
 (2, 3, '$25.00', datetime.date(2020, 2, 14)),
 (3, 1, '$20.00', datetime.date(2020, 2, 15)),
 (3, 2, '$15.00', datetime.date(2020, 2, 15)),
 (1, 4, '$5.00', datetime.date(2020, 2, 16))]

## The expected output

| user | net_change |
|----- |----------- |
| 1    | \$20.00    |
| 3    | \$5.00     |
| 4    | \$5.00     |
| 5    | -\$10.00   |
| 2    | -\$20.00   |

# Type your SQL below

In [4]:
# %% sql
#
# Type your query here